using System;
using System.Collections.Generic;
using System.Windows;
using System.Windows.Controls;
using static System.Net.Mime.MediaTypeNames;

namespace WpfApp1
{
    public partial class MainWindow : Window
    {
        Random random = new Random();
        List<string> warriorNames = new List<string> { "Коготь", "Клювик", "Слива", "Ёжик", "Дерево", "Дуб", "Берёзка", "Ива", "Клён", "Рябина",
    "Сосна", "Лес", "Трава", "Астра", "Багульник", "Валериана", "Василёк", "Зверобой", "Календула", "Клевер", "Крапива", "Кровохлёбка", "Лаванда", "Лопух",
    "Мак", "Мелисса", "Мята", "Одуванчик", "Пижма", "Подорожник", "Подсолнух", "Полынь", "Розмарин", "Ромашка", "Таволга", "Тысячелистник", "Чабрец",
    "Чистотел", "Шалфей", "Воздух", "Озеро", "Белка", "Медведь", "Волк", "Лиса", "Кабан", "Лось", "Заяц", "Росомаха", "Бобр", "Горностай", "Соболь",
    "Еж", "Енот", "Ласка", "Рысь", "Барсук", "Куница", "Выхухоль", "Бурундук", "Мышь", "Олень", "Тигр", "Норка", "Снегирь", "Синица", "Дятель",
    "Кукушка", "Иволга", "Соловей", "Филин", "Сипуха", "Сова", "Сыч", "Тетерев", "Пустельга", "Зяблик", "Солнце", "Луч", "Речушка", "Небосвод", "Небо",
    "Вода", "Капля", "Земля", "Почва", "Гора", "Скала", "Гриб", "Лисичка", "Подберёзовик", "Подосиновик", "Маслёнок", "Шампиньон", "Сыроежка", "Груздь",
    "Рыжик", "Опёнок", "Насекомое", "Водомерка", "Жук", "Муравей", "Пчела", "Оса", "Шмель", "Шершень", "Таракан", "Термит", "Бабочка", "Моль",
    "Муха", "Комар", "Паук", "Шашечница", "Крапивница", "Крушинница", "Белянка", "Голубянка", "Фрин", "Тарантул", "Каракурт", "Крестовик",
    "Лист", "Луг", "Полянка", "Дождь", "Ливень", "Ветер", "Метель", "Буран", "Ураган", "Смерч", "Пурга", "Рыба", "Сом", "Треска", "Скумбрия",
    "Сазан", "Форель", "Лосось", "Окунь", "Карась", "Кустик", "Ягода", "Барбарис", "Боярышник", "Брусника", "Бузина", "Виноградинка", "Голубика",
    "Вишня", "Ежевика", "Земляника", "Ирга", "Калина", "Кизил", "Клубника", "Клюква", "Смородина", "Крыжовник", "Малина", "Морошка", "Облепиха",
    "Оливка", "Черешня", "Черника", "Шиповник", "Песок", "Песчинка", "Туча", "Облако", "Роща", "Закат", "Рассвет", "Снег", "Снежинка",
    "Листопад", "Цветение", "Минерал", "Камень", "Осколок","Птенчик" };
        List<string> wordRequirements = new List<string> {
            "минимум три слова", "минимум четыре слова", "минимум пять слов",
            "минимум шесть слов", "максимум девять слов", "минимум восемь слов",
            "минимум семь слов", "минимум шесть слов"
        };

        public MainWindow()
        {
            InitializeComponent();
        }

        private void Button_Click(object sender, RoutedEventArgs e)
        {
            GenerateWarriorName();
        }

        private void GenerateWarriorName()
        {
            string warriorName = warriorNames[random.Next(warriorNames.Count)];
            string wordRequirement = wordRequirements[random.Next(wordRequirements.Count)];
            string result = warriorName + " (" + wordRequirement + ")";
            What.Text = result;

        }
    }
}
